file.xml

<!-- Bill Profile -->
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" 
    xmlns:sad="http://sadadGeneralServices">
    <soap:Header>
        <sad:requestHeader>
            <language>EN</language>
            <requestID>1234561234</requestID>
            <userID>CORPUser1/1dy4KMKJ5yQ=</userID>
            <customerNo>123456</customerNo>
            <channelID>CORPORATE</channelID>
            <tokenKey/>
            <cuid/>
            <idNumber/>
            <retry>false</retry>
        </sad:requestHeader>
    </soap:Header>
    <soap:Body>
        <sad:getBillProfileRequest>
            <customerNo>516319</customerNo>
            <officialId>ID1018212124</officialId>
            <billDetailsList>
                <!--Zero or more repetitions:-->
            </billDetailsList>
            <cuId>?</cuId>
        </sad:getBillProfileRequest>
    </soap:Body>
</soap:Envelope>
3:54 PM
response
3:55 PM
<NS1:Envelope xmlns:NS1="http://www.w3.org/2003/05/soap-envelope">
    <NS1:Header>
        <NS2:responseHeader xmlns:NS2="http://sadadGeneralServices">
            <state>SUCCESSFUL</state>
            <status>0</status>
            <nativeError></nativeError>
            <description>Successful</description>
            <messageID>cd617095-c6a8-495a-9f13-2196166786c0</messageID>
            <requestID>1234561234</requestID>
        </NS2:responseHeader>
    </NS1:Header>
    <NS1:Body>
        <NS3:getBillProfileResponse xmlns:NS3="http://sadadGeneralServices">
            <billProfileList>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>20010010902137</billingAcct>
                    <billerId>165</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>966565114483</billingAcct>
                    <billerId>005</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>598458654</billingAcct>
                    <billerId>044</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>966500003423</billingAcct>
                    <billerId>005</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>1110160002</billingAcct>
                    <billerId>101</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>59600999916</billingAcct>
                    <billerId>001</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>966500004710</billingAcct>
                    <billerId>005</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>43064325501</billingAcct>
                    <billerId>001</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>20010011202353</billingAcct>
                    <billerId>165</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>966500003173</billingAcct>
                    <billerId>005</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>2660130000</billingAcct>
                    <billerId>138</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>895432953</billingAcct>
                    <billerId>160</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>100003541</billingAcct>
                    <billerId>002</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>966002000148</billingAcct>
                    <billerId>005</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>000070060</billingAcct>
                    <billerId>039</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>305285324</billingAcct>
                    <billerId>024</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>966566559339</billingAcct>
                    <billerId>005</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>9669889900010</billingAcct>
                    <billerId>001</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>21112440001153</billingAcct>
                    <billerId>175</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>20160410001122</billingAcct>
                    <billerId>175</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>966542211770</billingAcct>
                    <billerId>005</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>20160600000150</billingAcct>
                    <billerId>175</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>966542211775</billingAcct>
                    <billerId>005</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>20160400001119</billingAcct>
                    <billerId>175</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>00224778788</billingAcct>
                    <billerId>001</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>10343271</billingAcct>
                    <billerId>157</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>100000220</billingAcct>
                    <billerId>142</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>96655650363</billingAcct>
                    <billerId>001</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>00771298862</billingAcct>
                    <billerId>001</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>00101931048</billingAcct>
                    <billerId>001</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>5868926033</billingAcct>
                    <billerId>018</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>96655650361</billingAcct>
                    <billerId>001</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>00105267754</billingAcct>
                    <billerId>001</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>00146663423</billingAcct>
                    <billerId>001</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>966002000144</billingAcct>
                    <billerId>005</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>598458653</billingAcct>
                    <billerId>044</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>895432958</billingAcct>
                    <billerId>160</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>966002000151</billingAcct>
                    <billerId>005</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>100000053</billingAcct>
                    <billerId>167</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>1000002794</billingAcct>
                    <billerId>058</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>100000042</billingAcct>
                    <billerId>124</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>966500003171</billingAcct>
                    <billerId>005</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>30007900186701</billingAcct>
                    <billerId>166</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>20160300000043</billingAcct>
                    <billerId>175</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>00771297804</billingAcct>
                    <billerId>001</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>966542242775</billingAcct>
                    <billerId>005</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>966542242778</billingAcct>
                    <billerId>005</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>30014916075552</billingAcct>
                    <billerId>166</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>00771298982</billingAcct>
                    <billerId>001</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>966569681688</billingAcct>
                    <billerId>005</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>1110160003</billingAcct>
                    <billerId>101</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>00144754375</billingAcct>
                    <billerId>001</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>70027701</billingAcct>
                    <billerId>022</billerId>
                </billProfile>
                <billProfile>
                    <isInProfile>true</isInProfile>
                    <billingAcct>99327701</billingAcct>
                    <billerId>022</billerId>
                </billProfile>
            </billProfileList>
            <totalRecordCount>54</totalRecordCount>
        </NS3:getBillProfileResponse>
    </NS1:Body>
</NS1:Envelope>


<!-- Make Bulk Payment -->
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" 
    xmlns:sad="http://sadadGeneralServices">
    <soap:Header>
        <sad:requestHeader>
            <language>EN</language>
            <requestID>12345612341</requestID>
            <userID>CORPUser1/1dy4KMKJ5yQ=</userID>
            <customerNo>123456</customerNo>
            <channelID>CORPORATE</channelID>
            <tokenKey/>
            <cuid/>
            <idNumber/>
            <retry>false</retry>
        </sad:requestHeader>
    </soap:Header>
    <soap:Body>
        <sad:makeBulkPaymentRequest>
            <customerNo>516319</customerNo>
            <fromAccount>
                <branch>0104</branch>
                <customerNo>289411</customerNo>
                <suffix>001</suffix>
            </fromAccount>
            <bulkPaymentFileID>1</bulkPaymentFileID>
            <status/>
            <billList>
                <!--Zero or more repetitions:-->
                <bill>
                    <billingAcct>20010010902137</billingAcct>
                    <billerId>165</billerId>
                </bill>
            </billList>
            <createBy/>
            <officialId>ID1018212124</officialId>
        </sad:makeBulkPaymentRequest>
    </soap:Body>
</soap:Envelope>

<NS1:Envelope xmlns:NS1="http://www.w3.org/2003/05/soap-envelope">
    <NS1:Header>
        <NS2:responseHeader xmlns:NS2="http://sadadGeneralServices">
            <state>SUCCESSFUL</state>
            <status>0</status>
            <nativeError></nativeError>
            <description>Successful</description>
            <messageID>e0b71663-3a84-4e62-832f-498cb9205319</messageID>
            <requestID>12345612341</requestID>
        </NS2:responseHeader>
    </NS1:Header>
    <NS1:Body>
        <NS3:makeBulkPaymentResponse xmlns:NS3="http://sadadGeneralServices"/>
    </NS1:Body>
</NS1:Envelope>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" 
    xmlns:sad="http://sadadGeneralServices">
    <soap:Header>
        <sad:requestHeader>
            <language>EN</language>
            <requestID>12345612356</requestID>
            <userID>CORPUser1/1dy4KMKJ5yQ=</userID>
            <customerNo>516319</customerNo>
            <channelID>CORPORATE</channelID>
            <tokenKey/>
            <cuid/>
            <idNumber/>
            <retry>false</retry>
        </sad:requestHeader>
    </soap:Header>
    <soap:Body>
        <sad:getBulkPaymentDetailsRequest>
            <customerNo>516319</customerNo>
            <statusList>
                <!--Zero or more repetitions:-->
                <status>PENDING_ACTIVATION</status>
            </statusList>
            <fromDate>2020-04-01T00:00:00</fromDate>
            <toDate>2020-04-05T00:00:00</toDate>
            <fileId></fileId>
            <subscriptionNo></subscriptionNo>
            <billerId></billerId>
            <pageInfo>
                <pageNo>0</pageNo>
                <pageSize>0</pageSize>
                <totalRecords>0</totalRecords>
                <orderBy></orderBy>
                <sortOrder>ASCENDING</sortOrder>
            </pageInfo>
        </sad:getBulkPaymentDetailsRequest>
    </soap:Body>
</soap:Envelope>

